# 4. Представлен список чисел. Определить элементы списка, не имеющие повторений.
# Сформировать итоговый массив чисел, соответствующих требованию.
# Элементы вывести в порядке их следования в исходном списке.
# Для выполнения задания обязательно использовать генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]

num_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]

new_nums2 = [i for i in num_list if num_list.count(i) == 1]
print(f"Исходный список: {num_list}")
print(f"Результат: {new_nums2}")

# вспомогательные действия при поиске решения
# for i in num_list:
#    if num_list.count(i) == 1:
#        print(i)

# не верное решение
# new_nums = [num_list[i] for i in range(len(num_list)-1) if num_list[i] / num_list[i+1] != 1]
# print(new_nums)
