# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
#
# Например, в первом задании выводим целые числа, начиная с 3,
# а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

""""
Решение а) итератор, генерирующий целые числа начиная с 5 до 15
"""
from itertools import count

for el in count(5):
    if el > 15:
        break
    else:
        print(el)


""" 
Решение б) итератор, повторяющий элементы некоторого списка, определенного заранее.
"""
from itertools import cycle
num_list = [1,2,3]

c = 0
for el in cycle(num_list):
    if c > 5:
        break
    print(el)
    c += 1

c = 0
for el in cycle("DOG"):
    if c > 3:
        break
    print(el)
    c += 1